app/models/user.rb

  def self.create_record
    self.create(name: "anubhaw", email: "anubhaw@gmail.com")
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "anubhaw"], ["email", "anubhaw@gmail.com"], ["created_at", "2019-12-16 01:55:30.478119"], ["updated_at", "2019-12-16 01:55:30.478119"]]

  def self.get_user_record email, name
    self.where(name: name, email: email).first
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 AND "users"."email" = $2 ORDER BY "users"."id" ASC LIMIT $3  [["name", "anubhaw"], ["email", "anubhaw@gmail.com"], ["LIMIT", 1]]